Repository: nadimtuhin/wp-hr-employee-leave-management
Catalog: languages/wp-employee-leaves-*.po
Languages: es_es, fr_fr

source: Employee Leaves
es_es: Permisos de Empleados
fr_fr: Congés des Employés

source: Dashboard
es_es: Panel de Control
fr_fr: Tableau de Bord

source: Leave Requests
es_es: Solicitudes de Permiso
fr_fr: Demandes de Congé

source: Employees
es_es: Empleados
fr_fr: Employés

source: Settings
es_es: Configuración
fr_fr: Paramètres

source: Employee Leaves Dashboard
es_es: Panel de Control de Permisos de Empleados
fr_fr: Tableau de Bord des Congés des Employés

source: Welcome to Employee Leaves Management
es_es: Bienvenido a la Gestión de Permisos de Empleados
fr_fr: Bienvenue dans la Gestion des Congés des Employés

source: Manage your employee leave requests efficiently with our comprehensive dashboard. Current year:
es_es: Gestiona las solicitudes de permiso de tus empleados de manera eficiente con nuestro panel integral. Año actual:
fr_fr: Gérez efficacement les demandes de congé de vos employés avec notre tableau de bord complet. Année actuelle :

source: View All Requests
es_es: Ver Todas las Solicitudes
fr_fr: Voir Toutes les Demandes

source: Total Requests
es_es: Solicitudes Totales
fr_fr: Demandes Totales

source: Pending Approval
es_es: Pendiente de Aprobación
fr_fr: En Attente d'Approbation

source: Approved
es_es: Aprobado
fr_fr: Approuvé

source: Rejected
es_es: Rechazado
fr_fr: Rejeté

source: Pending
es_es: Pendiente
fr_fr: En Attente

source: Recent Leave Requests
es_es: Solicitudes de Permiso Recientes
fr_fr: Demandes de Congé Récentes

source: No recent leave requests.
es_es: No hay solicitudes de permiso recientes.
fr_fr: Aucune demande de congé récente.

source: Employee
es_es: Empleado
fr_fr: Employé

source: Status
es_es: Estado
fr_fr: Statut

source: Date
es_es: Fecha

source: Quick Actions
es_es: Acciones Rápidas
fr_fr: Actions Rapides

source: Manage Requests
es_es: Gestionar Solicitudes
fr_fr: Gérer les Demandes

source: Employee Management
es_es: Gestión de Empleados
fr_fr: Gestion des Employés

source: System Overview
es_es: Resumen del Sistema
fr_fr: Aperçu du Système

source: Total Users
es_es: Usuarios Totales
fr_fr: Utilisateurs Totaux

source: HR Email Configured
es_es: Email de RRHH Configurado
fr_fr: Email RH Configuré

source: HR Email Missing
es_es: Email de RRHH Faltante
fr_fr: Email RH Manquant

source: Notifications Enabled
es_es: Notificaciones Habilitadas
fr_fr: Notifications Activées

source: Notifications Disabled
es_es: Notificaciones Deshabilitadas
fr_fr: Notifications Désactivées

source: Configure System
es_es: Configurar Sistema
fr_fr: Configurer le Système

source: Filter by Year:
es_es: Filtrar por Año:
fr_fr: Filtrer par Année :

source: Show:
es_es: Mostrar:
fr_fr: Afficher :

source: per page
es_es: por página
fr_fr: par page

source: Showing %d-%d of %d requests
es_es: Mostrando %d-%d de %d solicitudes
fr_fr: Affichage de %d-%d sur %d demandes

source: %d item
es_es: %d elemento
fr_fr: %d élément

source: Employee ID
es_es: ID del Empleado
fr_fr: ID Employé

source: Leave Dates
es_es: Fechas de Permiso
fr_fr: Dates de Congé

source: Leave Types
es_es: Tipos de Permiso
fr_fr: Types de Congé

source: Reason
es_es: Razón
fr_fr: Raison

source: Submitted
es_es: Enviado
fr_fr: Soumis

source: Actions
es_es: Acciones

source: No leave requests found for this year.
es_es: No se encontraron solicitudes de permiso para este año.
fr_fr: Aucune demande de congé trouvée pour cette année.

source: Approve
es_es: Aprobar
fr_fr: Approuver

source: Reject
es_es: Rechazar
fr_fr: Rejeter

source: &laquo; Previous
es_es: &laquo; Anterior
fr_fr: &laquo; Précédent

source: Next &raquo;
es_es: Siguiente &raquo;
fr_fr: Suivant &raquo;

source: Manage employee records and leave balances.
es_es: Gestionar registros de empleados y balances de permisos.
fr_fr: Gérer les dossiers des employés et les soldes de congés.

source: Employee Leaves Settings
es_es: Configuración de Permisos de Empleados
fr_fr: Paramètres des Congés des Employés

source: Email Templates
es_es: Plantillas de Email
fr_fr: Modèles d'Email

source: Page Management
es_es: Gestión de Páginas
fr_fr: Gestion des Pages

source: General Settings
es_es: Configuración General
fr_fr: Paramètres Généraux

source: HR Email Address
es_es: Dirección de Email de RRHH
fr_fr: Adresse Email RH

source: This email address will receive all leave request notifications.
es_es: Esta dirección de email recibirá todas las notificaciones de solicitudes de permiso.
fr_fr: Cette adresse email recevra toutes les notifications de demandes de congé.

source: Email Notifications
es_es: Notificaciones por Email
fr_fr: Notifications par Email

source: Enable email notifications
es_es: Habilitar notificaciones por email
fr_fr: Activer les notifications par email

source: Master switch for all email notifications. When disabled, no emails will be sent.
es_es: Interruptor principal para todas las notificaciones por email. Cuando está deshabilitado, no se enviarán emails.
fr_fr: Interrupteur principal pour toutes les notifications par email. Lorsqu'il est désactivé, aucun email ne sera envoyé.

source: Leave Request Submitted
es_es: Solicitud de Permiso Enviada
fr_fr: Demande de Congé Soumise

source: Send notifications when leave request is submitted
es_es: Enviar notificaciones cuando se envíe una solicitud de permiso
fr_fr: Envoyer des notifications lorsqu'une demande de congé est soumise

source: Notifies HR, managers, and relievers when a new leave request is submitted.
es_es: Notifica a RRHH, gerentes y sustitutos cuando se envía una nueva solicitud de permiso.
fr_fr: Notifie les RH, managers et remplaçants lorsqu'une nouvelle demande de congé est soumise.

source: Leave Request Approved
es_es: Solicitud de Permiso Aprobada
fr_fr: Demande de Congé Approuvée

source: Send notifications when leave request is approved
es_es: Enviar notificaciones cuando se apruebe una solicitud de permiso
fr_fr: Envoyer des notifications lorsqu'une demande de congé est approuvée

source: Notifies employee, managers, and relievers when a leave request is approved.
es_es: Notifica al empleado, gerentes y sustitutos cuando se aprueba una solicitud de permiso.
fr_fr: Notifie l'employé, les managers et les remplaçants lorsqu'une demande de congé est approuvée.

source: Leave Request Rejected
es_es: Solicitud de Permiso Rechazada
fr_fr: Demande de Congé Rejetée

source: Send notifications when leave request is rejected
es_es: Enviar notificaciones cuando se rechace una solicitud de permiso
fr_fr: Envoyer des notifications lorsqu'une demande de congé est rejetée

source: Notifies employee when a leave request is rejected.
es_es: Notifica al empleado cuando se rechaza una solicitud de permiso.
fr_fr: Notifie l'employé lorsqu'une demande de congé est rejetée.

source: Settings saved successfully!
es_es: ¡Configuración guardada exitosamente!
fr_fr: Paramètres sauvegardés avec succès !

source: Leave Types Management
es_es: Gestión de Tipos de Permiso
fr_fr: Gestion des Types de Congé

source: Leave Type
es_es: Tipo de Permiso
fr_fr: Type de Congé

source: Yearly Allocation (Days)
es_es: Asignación Anual (Días)
fr_fr: Allocation Annuelle (Jours)

source: Active
es_es: Activo
fr_fr: Actif

source: Sent to HR when a new leave request is submitted
es_es: Enviado a RRHH cuando se envía una nueva solicitud de permiso
fr_fr: Envoyé aux RH lorsqu'une nouvelle demande de congé est soumise

source: Sent to employee when their leave request is approved
es_es: Enviado al empleado cuando su solicitud de permiso es aprobada
fr_fr: Envoyé à l'employé lorsque sa demande de congé est approuvée

source: Sent to employee when their leave request is rejected
es_es: Enviado al empleado cuando su solicitud de permiso es rechazada
fr_fr: Envoyé à l'employé lorsque sa demande de congé est rejetée

source: Sent to managers when their team member submits a leave request
es_es: Enviado a gerentes cuando un miembro de su equipo envía una solicitud de permiso
fr_fr: Envoyé aux managers lorsqu'un membre de leur équipe soumet une demande de congé

source: Sent to leave relievers when they are assigned to cover someone
es_es: Enviado a sustitutos cuando se les asigna cubrir a alguien
fr_fr: Envoyé aux remplaçants lorsqu'ils sont assignés pour couvrir quelqu'un

source: Use these placeholders in your templates: {{employee_name}}, {{employee_email}}, {{leave_dates}}, {{leave_types}}, {{reason}}, {{manager_emails}}, {{reliever_emails}}, {{status}}, {{approved_date}}
es_es: Use estos marcadores en sus plantillas: {{employee_name}}, {{employee_email}}, {{leave_dates}}, {{leave_types}}, {{reason}}, {{manager_emails}}, {{reliever_emails}}, {{status}}, {{approved_date}}
fr_fr: Utilisez ces espaces réservés dans vos modèles : {{employee_name}}, {{employee_email}}, {{leave_dates}}, {{leave_types}}, {{reason}}, {{manager_emails}}, {{reliever_emails}}, {{status}}, {{approved_date}}

source: Subject
es_es: Asunto
fr_fr: Sujet

source: Body
es_es: Cuerpo
fr_fr: Corps

source: Leave types updated successfully!
es_es: ¡Tipos de permiso actualizados exitosamente!
fr_fr: Types de congé mis à jour avec succès !

source: Email templates updated successfully!
es_es: ¡Plantillas de email actualizadas exitosamente!
fr_fr: Modèles d'email mis à jour avec succès !

source: Create New Pages
es_es: Crear Nuevas Páginas
fr_fr: Créer de Nouvelles Pages

source: Create pages with leave management shortcodes automatically added.
es_es: Crear páginas con códigos cortos de gestión de permisos agregados automáticamente.
fr_fr: Créer des pages avec des codes courts de gestion des congés automatiquement ajoutés.

source: Leave Request Form
es_es: Formulario de Solicitud de Permiso
fr_fr: Formulaire de Demande de Congé

source: Create a page where employees can submit leave requests.
es_es: Crear una página donde los empleados puedan enviar solicitudes de permiso.
fr_fr: Créer une page où les employés peuvent soumettre des demandes de congé.

source: Enter page title (e.g., Submit Leave Request)
es_es: Ingrese el título de la página (ej., Enviar Solicitud de Permiso)
fr_fr: Entrez le titre de la page (ex. : Soumettre une Demande de Congé)

source: Create Page
es_es: Crear Página
fr_fr: Créer la Page

source: My Leave Requests
es_es: Mis Solicitudes de Permiso
fr_fr: Mes Demandes de Congé

source: Create a page where employees can view their leave request history.
es_es: Crear una página donde los empleados puedan ver su historial de solicitudes de permiso.
fr_fr: Créer une page où les employés peuvent consulter leur historique de demandes de congé.

source: Enter page title (e.g., My Leave Requests)
es_es: Ingrese el título de la página (ej., Mis Solicitudes de Permiso)
fr_fr: Entrez le titre de la page (ex. : Mes Demandes de Congé)

source: Please enter a page title
es_es: Por favor ingrese un título de página
fr_fr: Veuillez entrer un titre de page

source: Creating...
es_es: Creando...
fr_fr: Création en cours...

source: Unknown error occurred
es_es: Ocurrió un error desconocido
fr_fr: Une erreur inconnue s'est produite

source: An error occurred while creating the page. Details:
es_es: Ocurrió un error al crear la página. Detalles:
fr_fr: Une erreur s'est produite lors de la création de la page. Détails :

source: Please select a page
es_es: Por favor seleccione una página
fr_fr: Veuillez sélectionner une page

source: Adding...
es_es: Agregando...
fr_fr: Ajout en cours...

source: Add Shortcode
es_es: Agregar Código Corto
fr_fr: Ajouter le Code Court

source: An error occurred while adding the shortcode.
es_es: Ocurrió un error al agregar el código corto.
fr_fr: Une erreur s'est produite lors de l'ajout du code court.

source: Are you sure you want to approve this leave request?
es_es: ¿Está seguro de que desea aprobar esta solicitud de permiso?
fr_fr: Êtes-vous sûr de vouloir approuver cette demande de congé ?

source: Approving...
es_es: Aprobando...
fr_fr: Approbation en cours...

source: Leave request approved successfully!
es_es: ¡Solicitud de permiso aprobada exitosamente!
fr_fr: Demande de congé approuvée avec succès !

source: Network error occurred while processing the request.
es_es: Ocurrió un error de red al procesar la solicitud.
fr_fr: Une erreur réseau s'est produite lors du traitement de la demande.

source: Are you sure you want to reject this leave request?
es_es: ¿Está seguro de que desea rechazar esta solicitud de permiso?
fr_fr: Êtes-vous sûr de vouloir rejeter cette demande de congé ?

source: Rejecting...
es_es: Rechazando...
fr_fr: Rejet en cours...

source: Leave request rejected successfully!
es_es: ¡Solicitud de permiso rechazada exitosamente!
fr_fr: Demande de congé rejetée avec succès !

source: Invalid request ID.
es_es: ID de solicitud inválido.
fr_fr: ID de demande invalide.

source: Please fill in all required fields.
es_es: Por favor complete todos los campos requeridos.
fr_fr: Veuillez remplir tous les champs requis.

source: Saving...
es_es: Guardando...
fr_fr: Sauvegarde en cours...

source: Copy Shortcode
es_es: Copiar Código Corto
fr_fr: Copier le Code Court

source: Copied!
es_es: ¡Copiado!
fr_fr: Copié !

source: Submitting...
es_es: Enviando...
fr_fr: Soumission en cours...

source: Submit Leave Request
es_es: Enviar Solicitud de Permiso
fr_fr: Soumettre la Demande de Congé

source: Duplicate dates found:
es_es: Fechas duplicadas encontradas:
fr_fr: Dates dupliquées trouvées :

source: Please remove duplicate entries.
es_es: Por favor elimine las entradas duplicadas.
fr_fr: Veuillez supprimer les entrées dupliquées.

source: Please enter your employee ID.
es_es: Por favor ingrese su ID de empleado.
fr_fr: Veuillez entrer votre ID d'employé.

source: Please select at least one date and leave type.
es_es: Por favor seleccione al menos una fecha y tipo de permiso.
fr_fr: Veuillez sélectionner au moins une date et un type de congé.

source: Please provide a reason for your leave.
es_es: Por favor proporcione una razón para su permiso.
fr_fr: Veuillez fournir une raison pour votre congé.

source: Please fix the email validation errors before submitting.
es_es: Por favor corrija los errores de validación de email antes de enviar.
fr_fr: Veuillez corriger les erreurs de validation d'email avant de soumettre.

source: An error occurred while submitting your request. Please try again.
es_es: Ocurrió un error al enviar su solicitud. Por favor intente nuevamente.
fr_fr: Une erreur s'est produite lors de la soumission de votre demande. Veuillez réessayer.

source: Invalid email addresses in
es_es: Direcciones de email inválidas en
fr_fr: Adresses email invalides dans

source: General
fr_fr: Général

source: Error:
fr_fr: Erreur :
